In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
drinks = pd.read_csv('drinks.csv')
type(drinks)

pandas.core.frame.DataFrame

In [3]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [4]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [5]:
drinks.tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [13]:
drinks.describe()  # describe numeric columns

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [14]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [8]:
# a dataframe is like a complicated dictionary
# column names are the keys and the column is the value

d = {'a': [1, 2], 'b': [3, 4]}
pd.DataFrame(d)

   a  b
0  1  3
1  2  4

In [9]:
# how big is the dataset?
drinks.shape  # tuple of (rows, col)

(193, 5)

In [10]:
# find missing values
drinks.isnull()
drinks.isnull().sum()

country                         0
beer_servings                   0
spirit_servings                 0
wine_servings                   0
total_litres_of_pure_alcohol    0
dtype: int64

In [15]:
# missing values?
drinks[drinks['country'].isnull()]

Empty DataFrame
Columns: [country, beer_servings, spirit_servings, wine_servings, total_litres_of_pure_alcohol]
Index: []

In [16]:
# we can take data directly from url
# drinks = pd.read_csv('url')

In [18]:
# select a column
# drinks['country']
drinks.country

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
188      Venezuela
189        Vietnam
190          Yemen
191         Zambia
192       Zimbabwe
Name: country, Length: 193, dtype: object

In [19]:
drinks.country.describe()

count             193
unique            193
top       Afghanistan
freq                1
Name: country, dtype: object

In [21]:
drinks.beer_servings.value_counts()

beer_servings
0      15
5       5
25      4
21      4
31      4
       ..
234     1
69      1
28      1
142     1
64      1
Name: count, Length: 130, dtype: int64

In [22]:
drinks[['country', 'beer_servings']].head()

       country  beer_servings
0  Afghanistan              0
1      Albania             89
2      Algeria             25
3      Andorra            245
4       Angola            217

In [23]:
my_cols = ['country', 'beer_servings']
drinks[my_cols].head()

       country  beer_servings
0  Afghanistan              0
1      Albania             89
2      Algeria             25
3      Andorra            245
4       Angola            217

In [24]:
drinks['total_servings'] = drinks.beer_servings + drinks.spirit_servings + drinks.wine_servings
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,total_servings
0,Afghanistan,0,0,0,0.0,0
1,Albania,89,132,54,4.9,275
2,Algeria,25,0,14,0.7,39
3,Andorra,245,138,312,12.4,695
4,Angola,217,57,45,5.9,319